app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "image", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Dota2"], ["image", "dota.jpg"], ["state", 1], ["created_at", "2017-07-03 02:58:43.366060"], ["updated_at", "2017-07-03 02:58:43.366060"]]
---
	def create
		@category = Category.new(category_params)
		@category.state = 1
		@category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "image" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["image", "step3.jpg"], ["updated_at", "2017-07-03 02:47:47.006794"], ["id", 1]]
---
	def update
		@category = Category.find(params[:id])
		@category.update(category_params)