app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "answer_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "aaaaa"], ["answer_id", 2], ["user_id", 1], ["created_at", "2017-06-27 13:35:50.971212"], ["updated_at", "2017-06-27 13:35:50.971212"]]
---
	def post
		@comment = Comment.new(comment_params)
		@comment.save!