app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
	def index
		@questions = Question.all

SELECT  "questions".* FROM "questions" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
	def show
		@question = Question.find_by(params[:id])

SELECT "categories".* FROM "categories"
---
	def new
		@question = Question.new
		@categories_name = Category.all.collect {|p| [p.name, p.id]}

INSERT INTO "questions" ("content", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "哪只队伍会获得TI7冠军"], ["category_id", 1], ["created_at", "2017-07-02 08:59:50.106605"], ["updated_at", "2017-07-02 08:59:50.106605"]]
---
	def create
		@question = Question.new(question_params)
		@question.save

SELECT  "questions".* FROM "questions" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]
UPDATE "answers" SET "count" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["count", 1], ["updated_at", "2017-06-27 08:46:30.203624"], ["id", 2]]
UPDATE "questions" SET "count_r" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["count_r", 1], ["updated_at", "2017-06-27 07:30:02.363911"], ["id", 1]]
---
	def answer
		@question = Question.find_by(params[:question_id])
		@answer = @question.answers.find_by(id: params[:l_or_r])
		@comment = Comment.new
		@comments = @answer.comments
		if @answer
			@answer.count += 1
		else
			redirect_to @question
		end
		@answer.save

SELECT  "questions".* FROM "questions" WHERE (1) LIMIT ?  [["LIMIT", 1]]
UPDATE "questions" SET "star" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["star", 1], ["updated_at", "2017-06-27 19:11:22.873060"], ["id", 1]]
---
	def star
		@question = Question.find_by(params[:question_id])
		@question.star += 1
		@question.save

SELECT "questions".* FROM "questions" WHERE "questions"."category_id" = ?  [["category_id", 1]]
---
	def next
		@category = Question.find_by(params[:question_id]).category