app/controllers/questions_controller.rb

	def show
		@question = Question.find_by(id: params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def create
		@question = Question.new(question_params)
		@question.save
		2.times do |index|
			answer = Answer.new(answer_params[:answers_attributes][index])
			answer.question_id = @question.id
			answer.save
---
INSERT INTO "answers" ("created_at", "updated_at", "question_id") VALUES (?, ?, ?)  [["created_at", "2017-07-02 09:05:19.439863"], ["updated_at", "2017-07-02 09:05:19.439863"], ["question_id", 7]]

	def star
		@question = Question.find_by(id: params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]

	def next
		@category = Question.find_by(id: params[:question_id]).category
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]