app/views/categories/_user_index.html.erb

SELECT  "questions".* FROM "questions" WHERE "questions"."category_id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["category_id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
			<div class="col-md-4">
				<%= link_to image_tag("categories/#{category.image}",
				                      class: 'img-responsive'),
				            question_path(id: category.questions.first.id) %>